import 'package:flutter/material.dart';

class AppColors {
  static const Color color1 = Color(0xFFA3C7EB);
  static const Color color2 = Color(0xFFF0E392);
  static const Color color3 = Color(0xFFF0C9AC);
}

class Blogs {
  final int id;
  final String title;
  final String content;
  final Color? bgcolor;
  final String publishDate;

  Blogs({
    required this.id,
    required this.title,
    required this.content,
    this.bgcolor,
    required this.publishDate,
  });

  // Factory constructor to create a Blogs object from Supabase data
  factory Blogs.fromSupabase(Map<String, dynamic> data) {
    return Blogs(
      id: data['id'] as int,
      title: data['title'] as String,
      content: data['content'] as String,
      bgcolor: getColorFromHex(data['color'] as String),
      publishDate: data['created_at'] as String,
    );
  }

  // Helper method to convert hex color string to Color
  static Color getColorFromHex(String hexColor) {
    final buffer = StringBuffer();
    if (hexColor.length == 6 || hexColor.length == 7) {
      buffer.write('ff'); // Default alpha value (fully opaque)
      buffer.write(hexColor.replaceFirst('#', ''));
    } else if (hexColor.length == 8) {
      buffer.write(hexColor);
    }
    return Color(int.parse(buffer.toString(), radix: 16));
  }
}

List<Blogs> blogsList = [
  Blogs(
    id: 0,
    title: "ما هو اضطراب طيف التوحد ؟",
    content: """التوحُّد ليس مرضًا، فعند تشخيص الطفل بالتوحد فهذا يعني أن عقله يعمل بطريقة مختلفة عن الآخرين بحيث يؤثر على كيفية التفاعل مع الآخرين والتواصل الاجتماعي والسلوك، كما أن يكون له نقاط قوة وصعوبات مختلفة، وغالبًا لا يوجد في المظهر ما يميزهم عن الآخرين.
يشير مصطلح "الطيف" إلى مجموعة واسعة من الأعراض والسلوكيات التي قد يعاني منها الشخص؛ حيث يختلف التوحد باختلاف كل شخص مصاب به، على الرغم من أنه يمكن تشخيص التوحد في أي عمر إلا أن الأعراض تظهر بشكل عام في العامين الأولين من العمر، كما أن بعض الأطفال المصابين بالتوحد يمكن أن يكون قد اكتسب مهارات جديدة ويرتقون بمراحل التطور حتى عمر 18 إلى 24 شهرًا، ثم يتوقفون عن اكتساب مهارات جديدة أو يفقدون المهارات التي كانت لديهم من قبل.
عوامل الخطورة:
هناك العديد من العوامل المختلفة التي حُدِّدَت، بما في ذلك العوامل البيئية والبيولوجية والوراثية، حيث إن الأدلة المتاحة تشير إلى أن ما يلي قد يُعرِّض الأطفال لخطر أكبر للإصابة باضطراب طيف التوحد:
•	وجود شقيق مصاب باضطراب طيف التوحد.
•	الإصابة بحالات وراثية أو صبغية معينة (مثل متلازمة X الهشة أو التصلب الحدبي).
•	المعاناة من مضاعفات عند الولادة.
•	أن يكون مولودًا لأبوين أكبر سنًّا.
الأعراض:
من المهم ملاحظة أن بعض الأشخاص غير المصابين باضطراب طيف التوحد قد يعانون أيضًا من بعض هذه الأعراض، ولكن بالنسبة للأشخاص المصابين بالتوحد تمثل هذه الخصائص تحديًا وتشمل:
مهارات التواصل والتفاعل الاجتماعي:
•	يتجنب الاتصالَ بالعين أو لا يحافظ عليه.
•	لا يستجيب عندما يناديه أحد باسمه بعمر 9 أشهر.
•	لا يُظهِر تعابير على الوجه (مثل: السعادة والحزن والغضب والمفاجأة) بعمر 9 أشهر.
•	قد لا ينظر إلى الأشياء أو الأحداث التي ينظر إليها الوالدان أو يشير إليها.
•	يستخدم القليلَ من الإيماءات أو لا يستخدمها على الإطلاق بحلول عمر 12 شهرًا (مثل: عدم التلويح بالوداع).
•	لا يلاحظ عندما يتأذى الآخرون أو ينزعجون بعمر 24 شهرًا.
•	لا يلاحظ الأطفالَ الآخرين أو ينضم إليهم في اللعب بعمر 36 شهرًا.
السلوكيات أو الاهتمامات المقيدة أو المتكررة:
•	يُرتِّب الألعاب أو الأدوات وينزعج عند تغيير النظام.
•	يكرر الكلمات أو العبارات مرارًا وتكرارًا.
•	يلعب بالألعاب بنفس الطريقة في كل مرة.
•	يحب الروتين والنظام، ولديه صعوبة في التغيير أو الانتقال من نشاط إلى آخر.
•	يرفرف الأيدي، أو المشي على أصابع القدم لفترة طويلة، أو يدور في دوائر.
•	قد يكون حساسًا للغاية أو غير حساس على الإطلاق للروائح والأصوات والأضواء والقوام واللمس.
من المهم ملاحظة أن الأطفال المصابين قد لا يكون لديهم كل أو أي من السلوكيات المدرجة كأمثلة هنا.
""",
    bgcolor: AppColors.color1,
    publishDate:'2025-02-20' ,
  ),
  Blogs(
    id: 0,
    title: 'الفرق بين متلازمة اسبرجر و مرض التوحد',
    content: """متلازمة اسبرجر هي أحد أنواع اضطرابات طيف التوحد التي تؤثر بشكل كبير على التفاعل الاجتماعي والسلوك. على الرغم من التحديات التي يواجهها الأفراد المصابون بها، إلا أنهم يمكن أن يحققوا نجاحًا كبيرًا في حياتهم إذا تم تقديم الدعم المناسب لهم. من خلال التدخل المبكر، التعليم المخصص، والدعم الاجتماعي، يمكن للأفراد المصابين بمتلازمة أسبرجر أن يعيشوا حياة مُرضية ومليئة بالإنجازات.
التفاعل الاجتماعي:
الأشخاص الذين يعانون من متلازمة أسبرجر لديهم صعوبة في قراءة وفهم الإشارات الاجتماعية، مثل تعابير الوجه أو نبرة الصوت، ولكنهم غالبًا ما يرغبون في التفاعل الاجتماعي ويبحثون عن تكوين صداقات، على الرغم من أنهم قد يجدون صعوبة في تحقيق ذلك.
في المقابل، الأشخاص المصابون بالتوحد قد يظهرون اهتمامًا أقل بالتفاعل الاجتماعي بشكل عام. قد يبدون غير مبالين بالتفاعل مع الآخرين أو يفضلون الأنشطة الفردية. في الحالات الأكثر شدة، قد يتجنبون التواصل البصري أو يجدون صعوبة في فهم أو التعبير عن المشاعر.
القدرة على التفاعل مع الآخرين:
الأفراد الذين يعانون من متلازمة أسبرجر غالبًا ما يحاولون التواصل والتفاعل مع الآخرين، ولكنهم قد يظهرون سلوكيات غير ملائمة اجتماعيًا نتيجة لصعوباتهم في فهم القواعد الاجتماعية.
أما في حالة التوحد، فقد يكون هناك تفاوت كبير في القدرة على التفاعل مع الآخرين، حيث قد يحتاج بعض الأفراد إلى دعم كبير في تعلم كيفية التفاعل الاجتماعي.
القدرة على التواصل:
– من السمات البارزة لمتلازمة أسبرجر هي أن الأفراد غالبًا ما يمتلكون قدرة لغوية طبيعية أو متقدمة. قد يظهرون مهارات لغوية متقدمة بالنسبة لأعمارهم، ويستخدمون لغة معقدة أو أكاديمية في سن مبكر. ومع ذلك، قد تكون لديهم صعوبة في استخدام اللغة في سياق اجتماعي، مثل إجراء محادثة متبادلة.
استخدام اللغة:
– على النقيض من ذلك، الأشخاص المصابون بالتوحد قد يعانون من تأخر في تطور اللغة. قد يكون لديهم صعوبة في بدء أو الحفاظ على محادثة، وقد يستخدمون تكرار الكلام (إيكولاليا) أو يجدون صعوبة في التعبير عن أفكارهم بالكلمات.
في متلازمة اسبرجر، يمكن للأفراد أن يكون لديهم ميل إلى الحديث المطول عن مواضيع محددة تهمهم، بغض النظر عن اهتمام المستمع. قد يتحدثون بطرق نمطية أو غير ملائمة اجتماعيًا، ولكنهم يمتلكون مهارات لغوية قوية في مجالات معينة.
أما في حالة التوحد، قد يظهر الأطفال تأخرًا كبيرًا في استخدام اللغة، وقد يكون لديهم صعوبة في استخدام اللغة للتواصل مع الآخرين. قد يستخدمون لغة بسيطة أو غير نمطية، أو قد لا يتحدثون على الإطلاق في الحالات الأكثر شدة.
الفرق في السلوكيات والاهتمامات
السلوكيات المتكررة:
كلا من متلازمة أسبرجر والتوحد يمكن أن يتضمنا سلوكيات متكررة. في متلازمة أسبرجر، قد يكون التركيز المفرط على موضوع معين أو الاهتمام المفرط بتفاصيل معينة هو السمة البارزة. قد يظهر الأفراد اهتمامًا شديدًا بموضوعات محددة مثل القطارات أو الحاسوب.
المرونة في التفكير والسلوك:
الأشخاص المصابون بالتوحد قد يظهرون أيضًا سلوكيات نمطية مثل التكرار الحركي (مثل رفرفة اليدين) أو التمسك بروتين يومي محدد بشكل صارم. قد يكون لديهم اهتمامات محددة أو غير عادية، وقد يعانون من صعوبة كبيرة في التكيف مع التغييرات.
الأفراد الذين يعانون من متلازمة أسبرجر قد يظهرون صلابة في التفكير، ويواجهون صعوبة في التكيف مع التغييرات غير المتوقعة. ومع ذلك، فإنهم عادة ما يكونون قادرين على العمل بشكل مستقل في الأنشطة اليومية عندما يكون لديهم بيئة منظمة وداعمة.
أما في حالة التوحد، قد تكون الصلابة في التفكير أكثر وضوحًا، ويمكن أن تكون التغييرات في الروتين أو البيئة مرهقة جدًا للأشخاص المصابين بالتوحد. في الحالات الأكثر شدة، قد يحتاج الأفراد إلى دعم مكثف في الأنشطة اليومية.
الفرق في القدرات العقلية
القدرات العقلية والذكاء:
غالبًا ما يكون لدى الأفراد الذين يعانون من متلازمة أسبرجر مستوى طبيعي أو فوق المتوسط من الذكاء. بينما يظهر نبوغهم بشكل استثنائي في مجالات محددة مثل الرياضيات أو العلوم. ومع ذلك، قد تكون لديهم صعوبة في تطبيق هذه القدرات في الحياة اليومية بسبب التحديات الاجتماعية والسلوكية.
بالنسبة للأشخاص المصابين بالتوحد، قد يكون هناك تفاوت واسع في القدرات العقلية. يمكن أن يكون لدى بعض الأفراد تأخر عقلي كبير، بينما قد يكون لدى الآخرين قدرات معرفية متقدمة في مجالات محددة. البعض قد يظهرون قدرات خاصة في مجالات مثل الفن أو الموسيقى.

""",
    bgcolor:  AppColors.color2,
    publishDate:'2025-02-20' ,
  ),
  Blogs(
    id: 0,
    title: 'أهم 9 نصائح للتعامل مع اطفال التوحد',
    content: """
لكل طفل من اطفال التوحد عالمه الفريد الذي يتفاعل معه بطرق مختلفة. من المهم للغاية أن نتعلم كيف نقرأ هذه الإشارات ونستجيب لها بشكل مناسب.
التعرف على الاهتمامات: ابدأ بملاحظة الأنشطة التي يستمتع بها الطفل وتلك التي تسبب له الإزعاج. هذا يساعد في تكوين فهم أعمق لما يحفزه وما يثير قلقه.
توجيه الرعاية: استخدم هذه المعلومات لتكييف بيئته والأنشطة بما يتناسب مع احتياجاته.
التواصل الفعّال: تعلم كيف يفهم الطفل العالم من حوله يمكن أن يحسن التواصل. استخدم الأساليب التي تتناسب مع قدراته الإدراكية، سواء كانت بصرية أو لفظية أو حسية.
- التحفيز والمكافأة:
تعد تقنية التحفيز والمكافأة من الأساليب الفعّالة في تربية أطفال التوحد، حيث تعمل على تشجيع السلوكيات الإيجابية وتعزيز الثقة بالنفس. من خلال تقديم مكافآت مدروسة ومناسبة للإنجازات الصغيرة، يمكن للوالدين والمربين تحفيز الطفل على تكرار هذه السلوكيات وتطوير مهارات جديدة.
الثناء اللفظي، العناق، أو حتى ملصق ملون يمكن أن يكون لها تأثير كبير في تحسين سلوك الطفل.
- الالتزام بروتين يومي :
يعتبر الالتزام بروتين يومي أمرًا ضروريًا للأطفال المصابين بالتوحد. يفضل أن يكون الروتين منظمًا للغاية. يمكن تحقيق ذلك من خلال وضع جدول زمني يحدد أوقات الأكل والعلاج والمدرسة. وفي حالة حدوث تغيير ضروري في الخطة، يجب تنبيه الطفل مسبقًا لتجنب أي اضطراب.
- تعزيز الاستقلالية:
تعزيز الاستقلالية في الأطفال المصابين بالتوحد يبدأ بخطوات بسيطة ولكنها مؤثرة. علم طفلك كيفية القيام بالمهام اليومية مثل:
الاستحمام: علمه كيف يستحم بمفرده. استخدم روتينًا واضحًا يشمل غسل الجسم والشعر.
تناول الطعام: دعه يجرب تناول الطعام بمفرده. استخدم أطباق وأدوات مناسبة له.
ارتداء الملابس: علمه كيف يرتدي ملابسه بنفسه. اختر ملابس سهلة الارتداء.
مع الوقت، سيكتسب الطفل الثقة ليصبح أكثر استقلالية ويتعلم مهارات جديدة تساعده في حياته اليومية.
- علم طفلك أساليب لتهدئة غضبه:
استخدم روتينًا يوميًا مألوفًا وأدوات تهدئة مثل الألعاب الحسية لمساعدته على الشعور بالأمان. عندما يشعر بالقلق، قدم له الدعم بكلمات هادئة وتجنب الجدال، وذلك لإرساء جو من الهدوء والاستقرار. تذكر أن كيفية تهدئة طفل التوحد تختلف من طفل لآخر، لذا ابحث عن الطريقة التي تناسب طفلك بشكل أفضل. 
- لتعامل مع طفل التوحد في المدرسة :
التعامل مع اطفال التوحد في المدرسة يتطلب نهجًا مدروسًا ومتعاطفًا يراعي خصوصية هذه الحالة. إليك بعض النصائح لتسهيل هذه المهمة:
إنشاء روتين يومي: اطفال التوحد يزدهرون في بيئة متوقعة ومنظمة. تأكد من وجود جدول زمني ثابت وواضح للأنشطة اليومية
التواصل الواضح: التحدث بوضوح والاستعانة بالصور والفيديوهات في حالة وجود صعوبات لغوية
التعاون مع الأهل: التواصل باستمرار بين المدرسين وأهل الطفل لضمان توافق الأساليب التربوية في المنزل والمدرسة.
توفير بيئة داعمة: احرص على أن تكون الفصول الدراسية مريحة وخالية من المثيرات الحسية التي قد تزعج الطفل.
باتباع هذه النصائح، يمكن للمعلمين والمدرسة ككل أن يوفروا بيئة تعليمية مثالية تساعد الطفل التوحدي على التعلم والنمو بشكل أفضل.
- ادمج طفلك في الحياة اليومية:
غالبًا ما يتحاشى الآباء اصطحاب أبنائهم المصابين بالتوحد في الخروجات العامة خشية التصرفات غير المتوقعة. ومع ذلك، يمكن أن يسهم ضم اطفال التوحد إلى الأنشطة الخارجية مثل التسوق في تعزيز تأقلمه مع المجتمع وتعريفه بالبيئة المحيطة.
- أعد روتين نوم ثابت ومريح:
للتعامل مع اضطراب النوم عند الطفل التوحدي، من المهم إنشاء روتين نوم ثابت ومريح. تأكد من أن غرفة النوم هادئة ومظلمة قليلًا، وأن الفراش مريح. الروتين الليلي المتسق يمكن أن يساعد الطفل على الاسترخاء والنوم بشكل أفضل.
- درب طفلك التوحدي على التقبل والتعامل مع التغييرات :
لتعزيز قدرة الطفل التوحدي على التكيف مع التغييرات، من المهم تدريبه على استيعاب واقعه بشكل واقعي. يتطلب الأمر توجيه الطفل بلطف لفهم أن الحياة تحمل تقلبات وأنه يجب التعامل مع الأحداث كما تأتي. من الضروري أيضًا تقديم شرح مسبق للطفل حول الأنشطة المخطط لها. يُفضل البدء بتغييرات صغيرة وتدريجية قبل الانتقال إلى التغييرات الأكبر لتسهيل هذه العملية.
""",
    bgcolor: AppColors.color3,
    publishDate:'2025-02-20' ,
  ),
  Blogs(
    id: 0,
    title: '7 أخطاء شائعة عن المصابين بمرض التوحد',
    content: """مرض التوحد هو جزء من تنوع الطيف البشري، لذلك ينبغي على المجتمع أن يعمل على توفير بيئة داعمة ومساعدة للأشخاص المصابين بالتوحد، حيث يمكن للتفهم والتعاون أن يسهم في تعزيز قدرات ومواهب هؤلاء الأفراد.
من المهم أن نفهم أن كل فرد يعيش تحت طيف التوحد لديه قصة فريدة وخصائص فردية، لذا يجب أن نتجاوز النماذج النمطية والأفكار الخاطئة حول التوحد، ومن أبرز الأخطاء الشائعة عن المصابين بمرض التوحد نذكر:
1.	الأشخاص الذين يعانون من التوحد لديهم موهبة خاصة
الاعتقاد بأن جميع المصابين بالتوحد هم عباقرة في مجالات معينة فكرة خاطئة، على الرغم من أن بعض الأشخاص المصابين بالتوحد قد يظهرون مهارات استثنائية في مجالات معينة مثل: الرياضيات أو العلوم أو الموسيقى والفن، إلا أن هذا لا ينطبق على الجميع، وبالتالي يجب عدم التعميم.
2.	الأشخاص المصابون بالتوحد غير اجتماعيين
هذا ظن خاطئ بخصوص مرضى التوحد، فالعديد من المصابين بالتوحد يمتلكون رغبة في التواصل والتفاعل الاجتماعي، فعلى الرغم من صعوبات التواصل الاجتماعي التي يواجهها البعض منهم لكن يمكن أن يتعلموا هذه المهارات من خلال التدريب والتدخل المبكر، وقد يظهرون تحسنًا كبيرًا في هذه المجالات على مر الزمن، قد يحتاجون إلى دعم إضافي لتحقيق ذلك، ولكن الرغبة في العلاقات الاجتماعية والصداقات موجودة لديهم.
3.	المصابون بالتوحد لا يمكنهم العيش بشكل مستقل
هذا الاعتقاد عن مرضى التوحد خاطئ تمامًا، فالعديد من المصابين بالتوحد يستطيعون العيش بشكل مستقل بعد تلقي التدريب والدعم المناسب. يمكن للأشخاص المصابين بالتوحد أن يحققوا الاستقلالية في العمل، والحياة اليومية، والعلاقات الشخصية، وذلك من خلال توفير الدعم المناسب وتطوير المهارات الحياتية الضرورية بمساعدة المختصين.
4.	المصابون بالتوحد لا يمتلكون مشاعر
هذه الفكرة غير صحيحة، فعلى الرغم من أن المصابين بالتوحد قد يواجهون صعوبة في التعبير عن مشاعرهم وفهم مشاعر الآخرين، إلا أنهم يمتلكون مشاعر وعواطف مثل أي شخص آخر، لكن قد يكون لديهم طرق مختلفة للتعبير عنها أو قد يظهرون ردود فعل غير مألوفة، ولكن ذلك لا يعني أنهم لا يشعرون بالمشاعر.
 بينت دراسة أنه يمكن تعليم الأطفال المصابين بالتوحد التعاطف باستخدام التحفيز والتعزيز للاستجابة لمشاعر شخص آخر من خلال العبارات المناسبة ونبرة الصوت وتعبيرات الوجه والإيماءات.
5.	تعميم السلوك
مثلًا يعتقد البعض أن جميع المصابين بالتوحد يظهرون سلوكًا تكراريًا، على الرغم من أن السلوك التكراري قد يكون موجودًا لدى بعض المصابين بالتوحد، إلا أنه لا ينطبق على الجميع، فقد نجد بعضهم يفضل الروتين والترتيب، في حين يمكن لآخرين أن يتبعوا سلوكًا متنوعًا ومتغيرًا، فكل فرد يعيش مع التوحد له خصائصه الفردية المرتبطة بحالته الخاصة.
6.	التوحد قابل للشفاء
تشير بعض المصادر إلى أنه يمكن شفاء التوحد تمامًا، لكن التوحد ليس مرضًا يمكن شفاؤه بالكامل، بل إنه اضطراب تطوري يستمر مدى الحياة. يمكن للأفراد المصابين بالتوحد أن يتطوروا ويتعلموا مهارات جديدة ويحققوا تقدمًا في مجالات مختلفة في الحياة، ولكن التوحد لا يختفي تمامًا.
وهذا ما أوضحته دراسة أنه ليس من الممكن التخلص من مرض التوحد مع التقدم بالعمر، بمعنى آخر، تبدأ أعراض التوحد مبكرًا وتستمر طوال الحياة، وعلى الرغم من أن البالغين قد يكونون قادرين على إخفاء بعض الأعراض (على الأقل في بعض المواقف)، لكن هذا لا يعني الشفاء التام من التوحد.
7.	التأخر العقلي وصعوبات التعلم
يعتقد البعض أن جميع المصابين بالتوحد يعانون من تأخر عقلي، وهذا اعتقاد خاطئ، فالتوحد ليس بالضرورة أن يكون مرتبطًا بتدني مستوى الذكاء، بل يمكن أن يكون لدى العديد من المصابين بالتوحد مستويات ذكاء طبيعية أو حتى مرتفعة في بعض الحالات، وقد يكونون ذوي مهارات مميزة في مجالات معينة مثل: الرياضيات أو العلوم أو الفن.
""",
    bgcolor: AppColors.color1,
    publishDate:'2025-02-20' ,
  ),
  Blogs(
    id: 0,
    title: 'دور الأسرة في رعاية الطفل التوحدي',
    content: """
يعتبر دور الأسرة أساسياً في تطبيق البرامج التربوية والعلاجية للطفل التوحدين فالأسرة هي التي تقضي أكبر وقت مع الطفل وهي التي تراقب وتلاحظ على الأغلب وجود أي مشكلة أو تطورات على سلوكه، وهي التي تنقل المعلومات والملاحظات عن جوانبه غير العادية، والوالدين هما أول من يتلقى الصدمة والمفاجأة بعد مرحلة التشخيص، ويعيشان مراحل الرفض والانكار للحالة والتنقل من طبيب إلى آخر إلى أن يصل الأمر بهم لتقبل الحالة والبحث عن البرامج التربوية والعلاجية المناسبة، لذلك فهم يلعبون دوراً كبيراً في نجاح هذه البرامج.
وتقوم الأسرة بمساعدة الاختصاصيين على فهم العديد من جوانب الضعف أو القوة لدى الطفل، والتي لا تظهر عادة في أماكن  الملاحظة والفحص مثل العيادة أو المركز، بل تظهر لدى الأسرة فقط لأن الطفل لا يقوم بها إلا في المنزل ، لذلك تأتي هنا أهمية المشاركة الفاعلة للوادين منذ عملية التشخيص الأولى حتى صياغة البرامج التربوية وتطبيقها وتقييمها.
ويجب أن تكون الأسرة أحد أهم أعضاء فريق العمل فلديها من المعلومات التي تؤهل أفرادها من الناحية العملية لأخذ دور هام في اختيار الأهداف وتحديد الأولويات، ومتابعة التدريب وتسجيل التقدم الذي يطرأ على طفلهم في المنزل، وتدريبه على تعميم المهارات التي تعلمها في المدرسة، أو المركز ونقلها للمنزل.
وهناك العديد من أولياء الأمور الذين وصلوا لمرحلة الابتكار في العمل مع طفلهم التوحدي، وتوليد خيارات وبدائل جديدة لحل بعض المشكلات السلوكية التي تواجههم في المنزل وبالتالي التغلب عليها عن طريق التجريب والملاحظة، وإصرارهم على تغير سلوك طفلهم نحو الأفضل، وإشراكه في النشاطات الاجتماعية والزيارات والتفاعل مع الآخرين.
 
ومن العوامل والمتغيرات التي قد تؤثر سلباً على تطبيق البرامج التربوية والعلاجية المقدمة للطفل التوحدي ما يلي:
1-     حجم الأسرة وعدد أفرادها، مما يؤثر سلباً على الوقت الذي يمكن أفرادها لتخصيصه في متابعة الطفل.
2-     عمل الوالدين وغيابهما فترات زمنية طويلة عن المنزل، لذلك تأتي هنا أهمية ترتيب الأدوار التي سيقوم بها الوالدين تجاه الطفل وفقاً لطبيعة الظروف الأسرية.
3-     اعتماد هذه البرامج في تطبيقها ومتابعتها على الأم فقط دون إشراك بقية أفراد ألأسرة، لذلك ينبغي أن تتحمل الأسرة كاملة مسئولية التفاعل مع الطفل التوحدي والتعاون في حل مشكلاته والتعامل معه بطريقه مماثلة من الجميع.
4-     مدى تقبل أفراد الأسرة للطفل ورغبتهم وحماسهم للتغيير سلوكه، وكذلك طبيعة الروابط الأسرية ودرجة متانتها.
ومن الأمور العامة التي يجب أن تدركها أسرة الطفل التوحدي قابليته للتعليم وللتدريب وللتواصل مع الآخرين مهما كانت شدة إعاقته، وأن تضع الأسرة نصب عينيها التفاؤل نحو نجاح طرق التعامل معه، والصبر و المثابرة في العمل
 
من أهم الصفات والأمور التي يجب أن يتحلى بها والدي الطفل التوحدي مايلي:
o عدم الشعور بالذنب تجاه وجود هذا الطفل في الأسرة.
o الإبتعاد عن الانفعالات النفسية السلبية كالقلق والغضب والاكتئاب
o التفاؤل والأمل بإمكانية تطور مهارات الطفل.
o الصبر والمثابرة في العمل مع الطفل وعدم اليأس
o الاطلاع على كل ما يستجد في عالم التوحد لأ ن هذا الاضطراب لا يزال يلفه الغموض
o التكيف مع المشكلات السلوكية للطفل
o  القدرة على ايجاد الطريقة المناسبة للتواصل مع الطفل
o توليد بدائل الحل وعدم الاعتماد على طريقة واحدة
o   إشراك الطفل في المناسبات الأسرية وتعريف المجتمع بإعاقته
o   الالتحاق بمجموعات الدعم الأسري والاستفادة من تجارب الآخرين.
 
مستقبل الطفل التوحدي
 يعتمد جزء كبير من تطور مهارات الطفل التوحدي ونجاح البرامج العلاجية المقدمة على مدى التعاون بين المختصين والأسرة، وعلى مثابرة الوالدين في العمل مع طفلهما، وتشير الدراسات بأن 20-30% من الحالات الخفيفة ذات الذكاء العادي تتحسن مع التدريب، وإن أكثر من 70% من حالات التوحد تستمر معهم ويبقون بحاجة إلى رعاية تامة لعدم تحقيقهم الاستقلالية التامة في المعيشة.
 إن البيئة المتفهمة العطوفة التي تساند الطفل لا بد أن تساهم في تحقيق تحسن ملحوظ في حالته، وخاصة إذا كان الطفل غير مصاب بمضاعفات إضافية أو إعاقات مصاحبة، أما إذا كان الذكاء مرتفعاً مثل حالات (الأسبرجرز) Asperger Syndrome وبدأت العناية بها بشكل مبكر، فيستطيع الطفل تحقيق النجاح في التعليم النظامي حتى التعليم الجامعي وما فوقه كما حصل في الحالات الأربعة المشهورة في العالم حتى الآن والتي حصلت على الدكتوراه بالرغم من أن إحداها لا تتواصل بالكلام.
""",
    bgcolor:  AppColors.color2,
    publishDate:'2025-02-20' ,
  ),
  Blogs(
    id: 0,
    title: 'مفهوم الاضطراب الحسي و التكامل الحسي لدى الأطفال',
    content: """ما هو الاضطراب الحسي؟
الاضطراب الحسي أو ما يعرف باسم خلل التكامل الحسي هو اضطراب نمائي، ينشأ عندما لا يستطيع الجهاز العصبي والدماغ تحديداً من معالجة المدخلات الحسية للجسم بالشكل الصحيح. يؤدي ذلك لعدم قدرة الجسم على توفير استجابات مناسبة لمتطلبات البيئة المحيطة. بتعبير آخر هو عدم قدرة الحواس على القيام بالوظيفة التي خلقت لها. يسمى بعض الأخصائين الاضطراب الحسي بالاضطراب الخفي، حيث لا تظهر أعراضاً صريحةً على صاحبه.
في بعض الأحيان، يحدث أن واحدة أو أكثر من حواس الجسم لا يكتم نموها بالشكل. فتظهر ردة فعل الجهاز العصبي كواحدة من شكلين رئيسين: فرط في الحساسية Over Response. مثل انزعاج الطفل من الأصوات العالية. أو التقيؤ عند شم رائحة معينة. أو عدم قدرة الطفل على تناول طعام ذي ملمس معين. أم الشكل الثاني، فهو ضعف في الحساسية Under Response. مثل الأطفال الذين يعانون من ضعف في التواصل البصري، أو يقعون ويتعثرون باستمرار. ويصيب هذا الاضطراب واحدة أو أكثر من حواس الإنسان إما البصرية، أو السمعية، أو اللمسيّة، أو الذوقيّة، أو الشمّية ، أو الإحساس الدهليزي والتوازن لدى الإنسان.
ويحدث الاضطراب الحسي نتيجة خلل يصيب دماغ الإنسان. حيث يبلغ نسبة هذا الاضطراب ما بين 5-13 %. ويشكل الأطفال المشخصون بالتوحد النسبة الأعلى بقدر 70 % من النسبة الكلية التقريبية. 
تُعّرِف عدة دراسات التوحد كأحد الاضطرابات الحسية. ويوصي العديد من رواد البحث والتأهيل بإدراج الطفل المُشخّص بالإضراب ببرنامج تكاملي حسي علاجي وتأهيلي، في بيئة متعددة الحواس مثل الغرفة الحسية، أو الصالة الحسية أو الحديقة الحسية. حيث يقوم الأخصائي بعمل تمرينات نفسية وحركية مع الطفل حسب حاجته وحالته؛ لزيادة إحساسه بنفسه وجسده في الفراغ.
علامات الاضطراب الحسي
هناك بعض العلامات التي تدل على وجود اضطراب حسي. والتي تظهر في الغالب إما على شكل أعراض سلوكية ونفسية. مثل تجنب الطفل لملمس بعض الأشياء كالأقمشة والأغذية أو الابتعاد عن لمس شخص آخر. ولا بتكر  الطفل أو يحاول التجديد أثناء اللعب، ويشعر بأمان بإعادة نفس الألعاب أو البرامج التلفزيونية لمرات عديدة. كما يمكن أن يظهر الاضطراب على شكل أعراض جسدية، مثل: عدم الإحساس بالألم بسرعة، وصعوبة بالغة في الاستيقاظ. ويمكن أن تظهر أيضاً كمشكلة في السمع والاستجابة للأصوات. أو عكس ذلك، مثل الحالة التي تسمى بالشغف الحسي، والتي تجعل الأطفال في سعي دائم  لإصدار الضجيج والقفز والتسلق وتحطيم الأشياء بشكل مستمر.
علاج الاضطراب الحسي
خطة علاج أطفال التكامل الحسي عادة تسمى ب“ Sensory Diet ”، توضع من قبل إخصائي العلاج الوظيفي. وتشمل عدة أنشطة من التخاطب والمتطلبات الحسية للطفل. ويعتمد نجاح خطة العلاج بشكلٍ كبير على تعاون كل من هم في محيط الطفل: الأهل، المدرسة، والأقارب.
يمكن اتباع أكثر من طريقة لتحسين التعامل والتأقلم مع الاضطراب الحسي لدى الأطفال، على الرغم من عدم وجود علاج نهائي له. ومن هذه الطرق والأساليب هي العلاج الطبيعي باستخدام مبادئ التكامل الحسي. والعلاج البصري لتحسين التواصل البصري. والعلاج السمعي للتخفيف من انزعاجهم من أصوات معينة وتحسين قدراتهم على عمل أنشطة أخرى بوجود بعض الأصوات. وعلاج النطق وذلك لتأثير اضطراب التكامل الحسي على حركة اللسان ومخارج الحروف والنطق في معظم الأحيان. وعلاج الطعام (Food Therapy) للعمل عل تقبل الطفل الأطعمة مختلفة الملمس من خلال شم رائحة الطعام ولمسه باليدين بشكلٍ تدريجي وتأهيلي مدروس وبإشراف الأخصائي.
التكامل الحسي
التكامل الحسي هو العملية العصبية التي تُعبّر عن معالجة المدخلات الحسية المختلفة داخل المخ، وإصدار رد الفعل المناسب لهذه المدخلات بطريقة صحيحة. ويعد اللمس واللمس العميق، والإحساس الدهليزي، والإحساس العميق في المفاصل أهم المدخلات الحسية التي يتم العمل عليها؛ لتحفيزها للوصول مع الطفل لدرجة من التكامل الحسي. وعادةً ما يتم ذلك بمساندة أدوات الغرفة الحسية.
وتكمن أهمية التكامل الحسي في زيادة التفاعل مع البيئة والآخرين، واكتساب مهارات جديدة. ويؤثر ذلك بشكل أساسي على الجهاز العصبي من خلال زيادة النضج العصبي والتغذية العصبية النشيطة.
يتم تحفيز التكامل الحسي لدى الأطفال من خلال اتباع بروتوكول معين خلال الجلسات العلاجية. تقدم الغرفة الحسية بيئة يمكن للطفل أو البالغ التحكم في المدخلات الحسية داخلها، وضبطها لتكون مناسبة لكل شخص على حدة.
ويتضمن بروتوكول العلاج خلال الجلسات استخدام عدة أدوات داخل الغرفة الحسية؛ تعمل على تحفيز الحواس لديهم .نذكر من هذه الأدوات أرجوحة الجوكي وأرجوحة البحّار التي تهدف إلى زيادة التوازن واستثارة الإحساس الدهليزي لدى الأطفال. والألياف الضوئية وأنابيب الفقاعات والطاولة المضيئة التي تعمل كمنشط حسي بصري ولمسي وإدراكي في الوقت ذاته. كما أن حائط الملامس وأرضية الملامس يعملون على تحفيز اللمس وتقليل الحساسية من الملامس المختلفة. ويساعد لكيس الفضاء على التوازن ومعرفة حدود أجسامهم داخل الغرفة. وتساعد حقيبة الروائح على تحفيز حاسة الشم من خلال الأدوات العطرية الموجودة بداخلها.

""",
    bgcolor: AppColors.color3,
    publishDate:'2025-02-20' ,
  ),

];
