Repository: Nadajq/jisser_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: jisser
ar: جسر

# login_in
source: login
ar: تسجيل الدخول

source: Register
ar: التسجيل

source: Email
ar: البريد الإلكتروني

source: password
ar: كلمة المرور

source: Confirm password
ar: تأكيد كلمة المرور

source: You don't have an account?
ar: ليس لديك حساب؟

# create_account
source: Created account
ar: إنشاء حساب

source: Login as Specialist
ar: تسجيل الدخول كأخصائي

source: Login as Admin
ar: تسجيل الدخول كمسؤل

source: there was an error, try again later
ar: حدث خطأ ما. حاول مرة أخرى

source: check your internet connection
ar: تحقق من الاتصال بالإنترنت

source: your email or password is incorrect
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# thsi_email_is_not_registered
source: this email is not registered
ar: هذا البريد الإلكتروني غير مسجل

source: login successfully
ar: تم تسجيل الدخول بنجاح

source: please enter password
ar: يرجى إدخال كلمة المرور

source: please enter email
ar: يرجى إدخال البريد الإلكتروني

source: please enter username
ar: يرجى إدخال اسم المستخدم

source: please enter confirm password
ar: يرجى تأكيد كلمة المرور

source: the password does not match
ar: كلمة المرور غير متطابقة

source: change language
ar: تغيير اللغة

source: Back
ar: جوع

# create_new_account
source: Create account
ar: انشاء حساب

source: user name
ar: اسم المستخدم

source: You don't have an account in jisser?
ar: لديك حساب في جسر؟

source: this email is not registered as specialist
ar: هذا البريد الإلكتروني غير مسجل كأخصائي

source: Create specialist account
ar: إنشاء حساب أخصائي

source: there was an error selecting file
ar: حدث خطأ أثناء اختيار الملف

source: there was an error selecting image
ar: حدث خطأ أثناء اختيار الصورة

source: please select specialization
ar: يرجى اختيار التخصص

source: please select qualification
ar: يرجى اختيار المؤهل العلمي

source: please enter experience
ar: يرجى ادخال سنوات الخبرة

source: please upload personal file
ar: يرجى تحميل الملف الشخصي

source: please upload personal image
ar: يرجى تحميل الصورة الشخصية

source: this email is already registered
ar: البريد الإلكتروني مسجل مسبقاً

source: specialization
ar: التخصص

source: qualification
ar: المؤهل العلمي

source: years of experience
ar: سنوات الخبرة

source: upload personal file
ar: تحميل الملف الشخصي

source: upload personal image
ar: تحميل الصورة الشخصية

source: specialists
ar: الأخصائيين

source: No specialists available.
ar: لا يوجد اخصائيين متاحين

source: No blogs available.
ar: لا يوجد مدونات متاحة

source: logout
ar: تسجيل خروج

source: please select time and duration
ar: الرجاء اختيار وقت ومدة الجلسة

source: the session has been booked successfully!
ar: تم حجز الجلسة بنجاح!

source: failed to pay
ar: فشل في عملية الدفع

source: cancelled
ar: تم الإلغاء

source: there was an error selecting session
ar: حدث خطأ ما أثناء حجز الجلسة

source: offer sessions
ar: تقديم الجلسات

source: writing
ar: كتابية

source: session date
ar: تاريخ الجلسة

source: session time
ar: وقت الجلسة

source: session duration
ar: مدة الجلسة

source: book session
ar: حجز الجلسة

source: list of customer bookings
ar: قائمة حجوزات العملاء

source: client Name
ar: اسم العميل

source: there is no booking
ar: لا يوجد حجوزات

source: time table
ar: جدولة المواعيد

source: booking list
ar: قائمة الحجوزات

source: this time is already booked
ar: هذا الوقت محجوز بالفعل، يرجى اختيار وقت آخر

source: please select date
ar: الرجاء اختيار التاريخ

source: you must select 3 different times
ar: يجب اختيار 3 أوقات مختلفة

source: successfully saved schedule
ar: تم حفظ المواعيد بنجاح

source: there was an error saving schedule
ar: حدث خطأ أثناء حفظ المواعيد

source: choose date
ar: اختر التاريخ

source: date
ar: التاريخ

source: choose time
ar: اختر الوقت

source: time
ar: الوقت

source: save
ar: حفظ

source: confirm delete
ar: تأكيد الحذف

source: Are you sure you want to delete this user?
ar: هل أنت متأكد أنك تريد حذف هذا المستخدم؟

source: cancel
ar: الغاء

source: deteled successfully
ar: تم الحذف بنجاح

source: delete
ar: حذف

source: users
ar: المستخدمين

source: sessions
ar: الجلسات

source: blogs
ar: المدونات

# manage_users
source: users management
ar: إدارة المستخدمين

source: search
ar: بحث

# manage_specialists
source: specialists management
ar: إدارة الأخصائيين

source: specialist name
ar: اسم الأخصائي

source: status
ar: الحالة

source: edit
ar: تعديل

# manage_sessions
source: sessions management
ar: إدارة الجلسات

source: Are you sure you want to delete this blog?
ar: هل أنت متأكد أنك تريد حذف هذه المقالة؟

# manage_blogs
source: blogs management
ar: ادارة المدونات

# blog_title
source: title
ar: العنوان

source: active
ar: نشط

source: not active
ar: غير نشط

source: successfully updated
ar: تم تعديل البيانات بنجاح

source: Could not launch PDF
ar: لا يمكن تشغيل الملف

source: edit specialist account
ar: تعديل حساب الأخصائي

source: show qualification file
ar: عرض ملف المؤهل العلمي

# status_account
source: account status
ar: حالة الحساب

source: edit blog
ar: تعديل المدونة

source: publish date
ar: تاريخ النشر

source: content
ar: المحتوى

source: mental disorder...
ar: اضطراب طيف التوحد عبارة عن حالة ترتبط بنمو الدماغ...

source: add new blog
ar: إضافة مدونة جديدة

source: adding
ar: إضافة

source: please wait until session starts
ar: الرجاء الإنتظار حتى موعد بدء الجلسة

source: please rate session
ar: الرجاء تقييم الجلسة

source: send
ar: ارسال

source: there was an error updating rating
ar: حدث خطأ في تحديث التقييم

source: there is no messages
ar: لا توجد رسائل

source: writing a message...
ar: اكتب رسالة...

source: contact us
ar: تواصل معنا

# coping
source: coping successfully
ar: تم النسخ بنجاح
